#!/bin/bash

#Директория проекта
PROJECT_DIR=$(dirname $(pwd))'/'

#------------------------------------------------------------------------------
#----------------------------Тестирование--------------------------------------
#------------------------------------------------------------------------------
#Директория, где лежат тесты
PHPUNIT_TESTS=$PROJECT_DIR'test/Mnix'

#------------------------------------------------------------------------------
#----------------------------Анализ-покрытия-----------------------------------
#------------------------------------------------------------------------------
#Директория для отчета
PHPUNIT_COVERAGE=$PROJECT_DIR'doc/coverage'

#------------------------------------------------------------------------------
#----------------------------Документирование----------------------------------
#------------------------------------------------------------------------------
#Директория, куда будет записана документация
PHPDOC_TARGET=$PROJECT_DIR'doc/api'
#Директории, для сканирования, разделяются запятыми: dir1,dir2,...
PHPDOC_DIRS=$PROJECT_DIR'lib/Mnix/Db'
#Файлы, для сканирования, разделяются запятыми: file1,file2,...
PHPDOC_FILES=$PROJECT_DIR'lib/Mnix/Db.php'
#Стиль
PHPDOC_STYLE='HTML:frames:DOM/earthli'

#------------------------------------------------------------------------------
#----------------------------Запуск скриптов-----------------------------------
#------------------------------------------------------------------------------
#Запуск phpunit-тестирования
#phpunit $PHPUNIT_TESTS

#Предварительно очищаем директорию, куда будут записаны тесты, и создаём новую
rm -r $PHPDOC_TARGET
mkdir $PHPDOC_TARGET
#Запуск документирования
PHPDOC_TARGET='-t '$PHPDOC_TARGET
PHPDOC_DIRS='-d '$PHPDOC_DIRS
PHPDOC_FILES='-f '$PHPDOC_FILES
PHPDOC_STYLE='-o '$PHPDOC_STYLE
phpdoc $PROJECT_DIR $PHPDOC_FILES $PHPDOC_STYLE $PHPDOC_TARGET

#Предварительно очищаем директорию, куда будут записаны тесты, и создаём новую
rm -r $PHPUNIT_COVERAGE
mkdir $PHPUNIT_COVERAGE
#Запуск сoverage
phpunit --coverage-html $PHPUNIT_COVERAGE $PHPUNIT_TESTS